[{"title": "The Powerpuff Girls", "summary": "The Powerpuff Girls is an American animated superhero television series created by animator Craig McCracken and produced by Cartoon Network Studios for Cartoon Network. The show centers on Blossom, Bubbles, and Buttercup, three kindergarten-aged girls with superpowers. They live in the fictional city of Townsville with their father and creator, a scientist named Professor Utonium, and are frequently called upon by the city's mayor to help fight nearby criminals and other enemies using their powers.\nWhile attending his second year at CalArts in 1992, McCracken created a short film, Whoopass Stew!, about a trio of child superheroes known as the Whoopass Girls, which was only shown at festivals. Following the name change to The Powerpuff Girls, McCracken submitted his student film to Cartoon Network, who aired the series' refined pilot, \"Meat Fuzzy Lumpkins\", in its animation showcase program World Premiere Toons on February 20, 1995, along with its follow-up, \"Crime 101\", on January 28, 1996. Network executives gave McCracken the greenlight for a full series, which debuted as a Cartoon Cartoon on November 18, 1998.\nThe Powerpuff Girls aired on Cartoon Network for six seasons, three specials, and a feature film, with the final episode airing on March 25, 2005. A total of 78 episodes were produced, in addition to the two pilots, a Christmas special, the film, a tenth anniversary special, and a special episode in computer animation. Various spin-off media include an anime, three CD soundtracks, a home video collection, comic books, a series of video games, a 2016 reboot series, and an upcoming reboot series, as well as various licensed merchandise. The series has been nominated for six Emmy Awards, nine Annie Awards, and a Kids' Choice Award during its run.", "sections": {"Production": "During Craig McCracken's first year in the character animation program of CalArts, he wanted to produce an animated short film based on a wrestler-type character he made named \"El Fuego\". In June 1991, he drew three girls with large eyes, visually inspired by the paintings of Margaret Keane, on a small sheet of orange construction paper as a birthday card design for his brother. Looking for some \"diversity and balance\" in the drawing, he had created a blonde, a redhead, and a brunette. He liked how \"cute\" they looked and turned them into superheroes, thus replacing the aforementioned wrestler. The following year, the girls starred on McCracken's animated short Whoopass Stew! The Whoopass Girls in: A Sticky Situation. Initially, McCracken wanted to animate all four Whoopass Girls shorts, but only one was produced. McCracken's shorts were selected to be shown at Spike and Mike's Sick and Twisted Festival of Animation in 1994.\nWhile he was working on 2 Stupid Dogs in 1992, McCracken's Whoopass Girls short was picked up for a series by Cartoon Network. The name Whoopass was dropped for inclusion as part of the What a Cartoon! animated shorts showcase. McCracken explained that Cartoon Network executives believed no one would make a children's show with the word \"ass\" in it, so the title changed to The Powerpuff Girls and the \"can of whoopass\" was renamed \"Chemical X\". McCracken's new short, titled \"The Powerpuff Girls in: Meat Fuzzy Lumpkins\", aired as part the network's World Premiere Toon-In on February 20, 1995. The short was not as popular as Dexter's Laboratory, a project McCracken and former classmate Genndy Tartakovsky (who also directed many episodes of The Powerpuff Girls) worked on together; being the most popular of the shorts, Dexter's Laboratory was the first to be greenlit by the network. Furthermore, McCracken's cartoon did not do well with a test audience composed by 11-year-old boys; \"They were saying, 'This is stupid, little girls can't be heroes'\", he recalled in 1999. They also found the girls' designs to be disturbing, which caused McCracken to panic and attempt to redesign them in a more realistic style. However, Cartoon Network executive Mike Lazzo convinced McCracken to stay true to his original vision, and allowed him to produce a second Powerpuff Girls short titled \"Crime 101\", which aired on What a Cartoon! in early 1996. Veteran ABC announcer Ernie Anderson, who narrated the pilot episodes and died of cancer in 1997, was replaced by Tom Kenny when it became a series.\nFollowing the second short, Cartoon Network picked up The Powerpuff Girls for a regular animated series. McCracken said that the show did not go through a large development process, but he was advised to change the name of the three main characters to Pink, Blue and Green, since the network executives found it hard to differentiate them by Blossom, Bubbles and Buttercup. Instead, he put together a bible for the show, explaining the essential aspects of the characters. The Powerpuff Girls series debuted on November 18, 1998, and was the highest-rated premiere in Cartoon Network's history at the time. During its run, the series consistently scored the highest rating for an original series each week for the network across a wide range of demographics—from young children to adults. In October 2000, Cartoon Network credited the series for its Friday night prime time ratings win among cable networks. By the end of 2000, merchandising based on the series encompassed a whole variety of products, including T-shirts, toys, video games, lunchboxes, and dishware. Concerning the show's success, Craig McCracken has stated, \"I thought it would get on Cartoon Network and college kids would watch it and there would be a few random T-shirts out there in the rave scene or in record shops. But I had no idea that it would take off to this extent.\" The cost per each episode was $500,000. A theatrical film based on the show, The Powerpuff Girls Movie, was also commissioned that year and was released July 3, 2002. The film received positive reviews from critics but was a commercial failure, earning $16 million worldwide against its $11 million budget. The production of the film also marked the series' switch from traditional cel animation to the digital ink and paint technique.\nFollowing the series' fourth season, the closing of Hanna-Barbera Productions and the death of its executive William Hanna in 2001, along with the muted reception to The Powerpuff Girls Movie, McCracken left the series to focus on developing his next animated series for the network, Foster's Home for Imaginary Friends, leaving Chris Savino to take his place while production of The Powerpuff Girls was moved to Cartoon Network Studios. The show's last original run episode was on March 25, 2005; in all, six seasons were made. Cartoon Network had offered to give McCracken and Savino a seventh season of the series, but they believed six was enough, and that the series had run its course. \nAll of the original episodes were hand-drawn and produced at the Korean studio Rough Draft Studios, except the What a Cartoon! shorts, with the first one being animated at Animal House in Japan and the second being animated at Fil Cartoons in the Philippines. James L. Venable, Thomas Chase, & Steve Rucker composed the opening theme of the series, and Scottish band Bis performed the ending theme song, as played during the credits. The opening theme uses a sped-up drum break sample of \"Funky Drummer\" performed by Clyde Stubblefield."}}, {"title": "Hannah Montana", "summary": "Hannah Montana is an American teen sitcom created by Michael Poryes, Rich Correll, and Barry O'Brien that aired on Disney Channel for four seasons between March 2006 and January 2011. The series centers on Miley Stewart (played by Miley Cyrus), a teenage girl living a double life as famous pop singer Hannah Montana, an alter ego she adopted so she could maintain her anonymity and live a normal life as a typical teenager. Episodes deal with Miley's everyday struggles to cope with the social and personal issues of adolescence while maintaining the added complexities of her secret identity, which she sustains by wearing a blonde wig. Miley has strong relationships with her brother Jackson (Jason Earles) and father Robby Ray (Billy Ray Cyrus), as well as her best friends Lilly Truscott (Emily Osment) and Oliver Oken (Mitchel Musso), who become aware of her secret. Overarching themes include a focus on family and friendships as well as the importance of music and discovering one's identity.\nThe Walt Disney Company commissioned the series after the success of Disney Channel's previous music-based franchises, such as the made-for-television film High School Musical (2006). Hannah Montana was produced by It's a Laugh Productions in association with Poryes's production company, and premiered on Disney Channel on March 24, 2006. A concert film, Hannah Montana & Miley Cyrus: Best of Both Worlds Concert, in which Miley Cyrus performs as Hannah Montana and herself, was released in 2008. The following year, the feature film Hannah Montana: The Movie was released. The series concluded on January 16, 2011, as a result of Cyrus's growing popularity and music career, and her desire to move into more mature acting roles.\nHannah Montana is one of Disney Channel's most commercially successful franchises. It received consistently high viewership in the United States on cable television and influenced the development of merchandise, soundtrack albums, and concert tours; however, television critics disliked the writing and depiction of gender roles and stereotypes. Hannah Montana helped launch Cyrus's musical career and established her as a teen idol; after Cyrus began developing an increasingly provocative public image, commentators criticized Hannah Montana as having a negative influence on its audience. The series was nominated for four Primetime Emmy Awards for Outstanding Children's Program between 2007 and 2010; Cyrus won a Young Artist Award for Best Performance in a TV Series, Leading Young Actress in 2008.", "sections": {"Production": ""}}, {"title": "SpongeBob SquarePants", "summary": "SpongeBob SquarePants is an American animated comedy television series created by marine science educator and animator Stephen Hillenburg for Nickelodeon. It first aired as a sneak peek after the 1999 Kids' Choice Awards on May 1, 1999, and officially premiered on July 17, 1999. It chronicles the adventures of the titular character and his aquatic friends in the underwater city of Bikini Bottom.\nMany of the series' ideas originated in The Intertidal Zone, an unpublished educational comic book Hillenburg created in 1989 to teach his students about undersea life. Hillenburg joined Nickelodeon in 1992 as an artist on Rocko's Modern Life. After Rocko was cancelled in 1996, he began developing SpongeBob SquarePants into a television series, and in 1997, a seven-minute pilot was pitched to Nickelodeon. The network's executives wanted SpongeBob to be a child in school, but Hillenburg preferred SpongeBob to be an adult character. He was prepared to abandon the series, but compromised by creating Mrs. Puff and her boating school so SpongeBob could attend school as an adult.\nSpongeBob SquarePants received widespread critical acclaim in its early years, with praise given to its characters, surreal humor, writing, visuals, animation, and Hawaiian-influenced soundtrack, with the show's first three seasons often referred to as its \"golden era\". However, the series has also received criticism for a perceived decline in quality, particularly after Hillenburg departed from the series starting with its fourth season onward. Despite this, it is considered by many to be one of the greatest animated series of all time. The series was an immediate hit for Nickelodeon, beating Pokémon as the highest-rated and most viewed animated Saturday morning program from its premiere onward in 1999. From then onward, SpongeBob SquarePants continued to be Nickelodeon's highest-rated program, only being surpassed briefly in viewership several times throughout its run. SpongeBob SquarePants has won a variety of awards including six Annie Awards, eight Golden Reel Awards, four Emmy Awards, two BAFTA Children's Awards, and a record-breaking twenty-two Kids' Choice Awards. The show has been noted as a cultural touchstone for Millennials and Generation Z, becoming ubiquitous with internet culture and spawning numerous viral internet memes.\nThe series has run for fifteen seasons, with its fifteenth being confirmed in September 2023, and premiering in July 2024. A sixteenth season premiered on June 27, 2025. SpongeBob is the fourth longest-running American animated series in history, and the longest-running American children's animated series as of 2025, surpassing PBS Kids' Arthur. The series' popularity has made it a multimedia franchise, and Paramount Skydance's most profitable intellectual property. By 2019, it had generated over $13 billion in merchandising revenue. Since its debut, the series has also had five theatrical feature films (starting with The SpongeBob SquarePants Movie in 2004), two feature films for streaming, a Broadway musical, a comic book series, and numerous video games. The series eventually expanded into spin-off series, with the CGI-series Kamp Koral: SpongeBob's Under Years and traditionally-animated series The Patrick Star Show both premiering in 2021, with the former ending in July 2024.", "sections": {"Production": ""}}, {"title": "Kim Possible", "summary": "Kim Possible is an American animated action comedy television series created by Bob Schooley and Mark McCorkle for Disney Channel. The title character is a teenage girl tasked with saving the world on a regular basis while coping with everyday issues commonly associated with adolescence. Kim is aided by her clumsy best friend, Ron Stoppable, his pet naked mole rat Rufus, and ten-year-old computer genius Wade. Known collectively as Team Possible, Kim and Ron's missions primarily require them to thwart the evil plans of the mad scientist–supervillain duo Dr. Drakken and his sidekick Shego.\nVeteran Disney Channel writers Schooley and McCorkle were recruited by the network to develop an animated series that could attract both older and younger audiences, and conceived Kim Possible as a show about a talented action heroine and her less competent sidekick. Inspired by the scarcity of female-led animated series at the time, Kim Possible is based on the creators' own high school experiences, and combines elements of action, adventure, drama, romance and comedy to appeal to both girls and boys while parodying the James Bond franchise and spy and superhero films. Distinct from other Disney Channel shows in its use of self-referential humor, Schooley and McCorkle developed fast-paced sitcom-style dialogue in order to cater to adult viewers. Set in the fictional town of Middleton, the show's setting and locations exhibit a retro-influenced aesthetic.\nKim Possible is the second original animated series, after The Proud Family, to air exclusively on Disney Channel, as well as the second show on the network to be produced by Walt Disney Television Animation as an original series. It also became the first Disney Channel animated series to be produced in high-definition. The series premiered on June 7, 2002, and ended on September 7, 2007, after 87 episodes and four seasons. Kim Possible received critical acclaim, becoming one of Disney's top-rated and most popular series. During its run, a pair of made-for-TV films were made: A Sitch in Time (2003) and So the Drama (2005). Merchandising based on the series, such as home media releases, toys, and video games were also made. A live-action television film of the same name was released in 2019.", "sections": {"Production": ""}}, {"title": "Rugrats", "summary": "Rugrats is an American animated television series created by Arlene Klasky, Gábor Csupó, and Paul Germain for Nickelodeon. The series focuses on a group of toddlers, most prominently Tommy Pickles, Chuckie Finster, and twins Phil and Lil DeVille, and their day-to-day lives, usually involving life experiences that become much greater adventures in the imaginations of the main characters.\nThe series premiered on August 11, 1991. It is the second of the original three Nickelodeon animated series known as \"Nicktoons\", after Doug and before The Ren & Stimpy Show. The series initially lasted for 65 episodes spanning three seasons. Production was then halted, and Germain left Klasky Csupo Inc. in 1993 with the last episode airing on November 12, 1994. In 1995 and 1996, two Jewish-themed specials premiered, \"A Rugrats Passover\" and \"A Rugrats Chanukah\", respectively. During this time, after the end of its original run, Rugrats began to receive a boost in ratings and popularity due to frequent reruns on Nickelodeon.\nIn 1996, Klasky Csupo Inc. began producing new episodes with a new writing staff, and the series' fourth season began airing in 1997. As a result of its popularity, a series of theatrical films were released over the next five years: The Rugrats Movie, which introduced Tommy's younger brother Dil, was released in 1998, Rugrats in Paris: The Movie, which introduced Chuckie's stepmother Kira, his stepsister Kimi, and a poodle named Fifi, was released in 2000, and Rugrats Go Wild, a crossover film with another Klasky Csupo series, The Wild Thornberrys, was released in 2003.\nOn July 21, 2001, Nickelodeon broadcast the TV special All Growed Up to celebrate the 10th anniversary of the series. The special would eventually be considered a pilot for the Rugrats sequel series All Grown Up!, which aired from 2003 to 2008. It chronicles the lives of the characters after they age 10 years. The final episode of Rugrats aired on August 1, 2004, bringing the series to a total of 172 episodes over nine seasons. Two direct-to-video specials were released in 2005 and 2006 under the moniker Rugrats Tales from the Crib. A spin-off series, Rugrats Pre-School Daze, aired four episodes in 2008. \nThe 13-year run ties Rugrats with King of the Hill as the eighth-longest-running American animated television series. Rugrats is Nickelodeon's third longest-running animated series, behind SpongeBob SquarePants and The Fairly OddParents, and one of the longest-running animated series overall. Until SpongeBob SquarePants aired its 173rd episode in 2012, Rugrats was Nickelodeon's longest-running cartoon.\nRugrats received critical acclaim, with praise to its writing, creativity, themes, characters, music, and appealing towards all ages. It gained over 20 awards, including four Daytime Emmy Awards, six Kids' Choice Awards, and its own star on the Hollywood Walk of Fame. The series anchored Nickelodeon as the network's top-rated series from 1995 to 2001 and is considered to be one of the greatest animated series of all time. Tie-in media for the series include video games, comics, toys, and various other merchandise.\nA reboot of the series executive-produced by the original creative team of Klasky, Csupó, and Germain premiered on Paramount+ in 2021.", "sections": {"Production": "Episodes took up to a year in advance to produce. After the episode's story was written and approved, the next phase consisted of voice recording, storyboarding, pre-eliminating animation, overseas production, overseas delivery, followed by editing and polishing."}}]